Revit 2027 API
DocumentWorksharingEnabledEventArgs Methods
The DocumentWorksharingEnabledEventArgs type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from RevitAPIEventArgs)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetDocument |  Returns document associated with this event
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCancelled |  Indicates whether the event is being cancelled.
(Inherited from RevitAPIEventArgs)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace